main.window.title=TPT Demo
main.window.logo=Toolkit Productivity Tools Demo
main.window.version=version 1.0

developer.handbook=Kehitt\u00E4j\u00E4n k\u00E4sikirja



sections.windows.title=Ikkunat
sections.windows.info=Vaadin Window komponentin laajennus

sections.windows.tptwindow.title=TPTWindow
sections.windows.tptwindow.info=Laajennettu versio Vaadin Window -luokasta, joka automaattisesti k\u00E4sittelee ESC ja Enter n\u00E4pp\u00E4inten painallukset, n\u00E4ytt\u00E4\u00E4 huomautukset, sek\u00E4 rivitt\u00E4\u00E4 ja muuntaa ne HTML-muotoisiksi.
sections.windows.tptwindow.instance=TPT Window -luokan olio
sections.windows.tptwindow.button=N\u00E4yt\u00E4 laajennettu huomautus
sections.windows.tptwindow.label=Koeta painaa Enter tai ESC n\u00E4pp\u00E4int\u00E4 n\u00E4hd\u00E4ksesi kuinka ne k\u00E4sitell\u00E4\u00E4n. Huomaa ett\u00E4 n\u00E4pp\u00E4imen painallukset k\u00E4sitell\u00E4\u00E4n vain jos jokin komponentti, esimerkiksi nappi, on valittuna.
sections.windows.tptwindow.notify.title=Laajennettu Huomatus
sections.windows.tptwindow.notify.text=Huomatusteksti voi sis\u00E4lt\u00E4\u00E4 rivinvaihtoja.\nRivinvaihdot muunnetaan\nautomaattisesti HTML -muotoon &lt;br&gt\njotta ne voidaan n\u00E4ytt\u00E4\u00E4 ruudulla oikein. Vaadin Window -luokan showNotification -metodi ei tee t\u00E4t\u00E4 automaattisesti.
sections.windows.tptwindow.enter.title=Enter -n\u00E4pp\u00E4int\u00E4 painettu
sections.windows.tptwindow.enter.text=Enter -n\u00E4pp\u00E4int\u00E4 on painettu ja n\u00E4pp\u00E4imen painamisesta aiheutunut tapahtuma\ntulkittiin automaattisesti t\u00E4ss\u00E4 ikkunassa.
sections.windows.tptwindow.esc.title=ESC -n\u00E4pp\u00E4int\u00E4 painettu
sections.windows.tptwindow.esc.text=ESC -n\u00E4pp\u00E4int\u00E4 painettiin ja n\u00E4pp\u00E4imen painamisesta aiheutunut tapahtuma\ntulkittiin automaattisesti t\u00E4ss\u00E4 ikkunassa.
sections.windows.tpthtmlwindow.title=TPTHTMLWindow
sections.windows.tpthtmlwindow.info=Toteuttaa kaikki TPTWindow -luokan toiminnot ja lis\u00E4\u00E4 mahdollisuuden HTML pohjan lis\u00E4\u00E4miseen ikkunaan CustomLayout -komponenttina.
sections.windows.tpthtmlwindow.caption=TPTHtmlWindow -luokan olio
sections.windows.tpthtmlwindow.search=Haettu


sections.widgets.title=K\u00E4ytt\u00F6liittym\u00E4komponentit
sections.widgets.info=Yleisk\u00E4ytt\u00F6iset k\u00E4ytt\u00F6liittym\u00E4komponentit, joita voidaan k\u00E4ytt\u00E4\u00E4 miss\u00E4 vain Vaadin -ohjelmassa.

sections.widgets.view.title=N\u00E4kymien hallinta
sections.widgets.view.info=TPTMultiView on n\u00E4kymien hallintaan tarkoitettu komponentti, joka mahdollistaa useiden eri n\u00E4kymien vaihtamisen n\u00E4kyviin k\u00E4ytt\u00F6liittym\u00E4ss\u00E4 ja parametrien v\u00E4lityksen n\u00E4kymien v\u00E4lill\u00E4. Komponentin toiminta vastaa pitk\u00E4lti TabSheet -komponentin toimintaa, mutta komponentilla ei ole n\u00E4kyv\u00E4\u00E4 k\u00E4ytt\u00F6liittym\u00E4\u00E4 ja DOM-puussa pidet\u00E4\u00E4n vain kulloinkin n\u00E4kyviss\u00E4 oleva n\u00E4kym\u00E4.
multiview.demo.title=TPTMultiView Demo
go.to.view.1=Vaihda n\u00E4kym\u00E4\u00E4n 1
go.to.view.2=Vaihda n\u00E4kym\u00E4\u00E4n 2
go.to.view.3=Vaihda n\u00E4kym\u00E4\u00E4n 3
view1.title=N\u00E4kym\u00E4 1
view2.title=N\u00E4kym\u00E4 2
view3.title=N\u00E4kym\u00E4 3
view.upload1.title=Tiedostojen l\u00E4hetys #1
view.upload2.title=Tiedostojen l\u00E4hetys #2
view.upload3.title=Tiedostojen l\u00E4hetys #3

lazyloader.title=Lazy Loading Layout
lazyloader.info=TPTLazyLoadingLayout mahdollistaa k\u00E4ytt\u00F6liittym\u00E4komponenttien alustuksen taustaprosessina siten ett\u00E4 alustuksen aikana n\u00E4ytet\u00E4\u00E4n lataus-kuvake kunnes k\u00E4ytt\u00F6liittym\u00E4komponentti on alustettu. Alustuksen valmistuttua k\u00E4ytt\u00F6liittym\u00E4komponentit n\u00E4ytet\u00E4\u00E4n v\u00E4litt\u00F6m\u00E4sti.
lazyloader.caption=TPTLazyLoadingLayout Demo
lazyloader.progress=Ladataan tilin historiatietoa tietokannasta. Ole hyv\u00E4 ja odota...
lazyloader.sample1=01.01.2008 Tili avattu
lazyloader.sample2=02.01.2008 + EUR 5000.00 Luotto
lazyloader.sample3=03.01.2008 - EUR 150.00 Tilisiirto
lazyloader.sample4=12.01.2008 - EUR 500.00 K\u00E4teisnosto
lazyloader.sample5=28.01.2008 - EUR 255.12 China Tiger -ravintola

cap.title=Captcha Widget
cap.info=Captcha -komponentti n\u00E4ytt\u00E4\u00E4 satunnaisia kirjaimia kuvassa ja pyyt\u00E4\u00E4 k\u00E4ytt\u00E4j\u00E4\u00E4 tunnistamaan n\u00E4m\u00E4 kirjaimet. Komponentilla varmistetaan ett\u00E4 k\u00E4ytt\u00E4j\u00E4 on ihminen ja voidaan suojautua esimerkiksi roskapostia l\u00E4hett\u00E4vilt\u00E4 automaateilta.
cap.caption=Captcha Demo
cap.change=Change ohjelmakoodi

i18n.title=Monikielituki
i18n.info=T\u00E4m\u00E4 demo-ohjelma on esimerkki monikielituen k\u00E4yt\u00F6st\u00E4. Yrit\u00E4 avata ohjelma sellaisella selaimella joka on asetettu n\u00E4ytt\u00E4m\u00E4\u00E4n oletuksena eri kieli\u00E4 - huomaat ett\u00E4 k\u00E4ytt\u00F6liittym\u00E4 muuttuu selaimen asetuksista valitun oletuskielen mukaisesti.<br/>Demo tukee t\u00E4ll\u00E4 hetkell\u00E4 englannin, ven\u00E4j\u00E4n ja suomen -kielt\u00E4. Jos selaimesta on valittu jokin muu kieli, n\u00E4ytet\u00E4\u00E4n k\u00E4ytt\u00F6liittym\u00E4 englanniksi.<br/>Lis\u00E4tietoja monikielituen k\u00E4yt\u00F6st\u00E4 l\u00F6ytyy kehitt\u00E4j\u00E4n k\u00E4sikirjasta.

qd.title=Kysymysikkuna
qd.info=Kysymysikkuna on ponnahdusikkuna jossa on otsikko, kysymys, sek\u00E4 "Kyll\u00E4" ja "Ei" napit.
qd.caption=Huomautus
qd.text=Oletko varma ett\u00E4 haluat poistua j\u00E4rjestelm\u00E4st\u00E4?
qd.reply=Vastauksesi:

md.title=Viesti-ikkuna
md.info=Viesti-ikkuna n\u00E4ytt\u00E4\u00E4 yksinkertaisen viestin ponnahdusikkunassa. Ikkuna suljetaan "Ok" -napilla.
md.message=Kauppa on ly\u00F6ty lukkoon.
md.reply=Kauppa tehty!

dd.title=Tiedoston lataus-ikkuna
dd.info=Tiedoston lataus-ikkuna n\u00E4ytt\u00E4\u00E4 ponnahdusikkunan jossa on otsikko, viesti ja latauslinkki tiedoston lataamiseksi.
dd.message=Lataa t\u00E4m\u00E4 !

cd.title=Mukautettava ikkuna
cd.info=Mukautettava ikkuna mahdollistaa mink\u00E4 vain k\u00E4ytt\u00F6liittym\u00E4komponentin n\u00E4ytt\u00E4misen ponnahdusikkunassa jossa on vakioidut napit.
cd.reply= painettu...

cdd.title=Varmistus-ikkuna
cdd.info=Varmistus-ikkuna on yksinkertainen ponnahdusikkuna jossa on otsikko, viesti, sek\u00E4 "Ok" ja "Peruuta" -napit.
cdd.message=Diili olisi t\u00E4ll\u00E4inen. Tehd\u00E4\u00E4nk\u00F6 kaupat?
cdd.reply=Diili on

cqd.title=Peruutettava kysymys-ikkuna
cqd.info=Peruutettava kysymys-ikkuna on ponnahdusikkuna jossa on otsikko, kysymys, sek\u00E4 "Kyll\u00E4", "Ei" ja "Peruuta" -napit.
cqd.message=Haluatko sulkea ohjelman?
cqd.reply=Vastauksesi:

java.src.title=Java-l\u00E4hdekoodi
demo.run=Aja demo
demo.src=N\u00E4yt\u00E4 Java-l\u00E4hdekoodi

sizer.title=V\u00E4listys-komponentti
sizer.info=TPTSizer on k\u00E4ytt\u00F6liittym\u00E4komponentti jolla voidaan nopeasti lis\u00E4t\u00E4 k\u00E4ytt\u00F6liittym\u00E4\u00E4n v\u00E4lej\u00E4 joiden korkeus ja leveys on m\u00E4\u00E4ritelty.
sizer.caption=TPTSizer Demo
sizer.label1=Teksti 1
sizer.label2=Teksti 2. T\u00E4m\u00E4 teksti on tarkalleen 30 pikseli\u00E4 ensimm\u00E4isen tekstin alapuolella - kiitos TPTSizer -komponentin joka on sijoitettu tekstien v\u00E4liin!

sections.dialogs.title=Yleis-ikkuna
sections.dialogs.info=Esittelee TPT:ll\u00E4 rakennetun yleis-ikkunan k\u00E4ytt\u00F6\u00E4.
