main.window.title=\u0414\u0435\u043C\u043E\u043D\u0441\u0442\u0440\u0430\u0446\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0439 TPT
main.window.logo=Toolkit Productivity Tools
main.window.version=\u0432\u0435\u0440\u0441\u0438\u044F 1.1.0 \u0431\u0435\u0442\u0430

developer.handbook=\u0420\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0430



sections.windows.title=\u041E\u043A\u043D\u0430
sections.windows.info=\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 Window \u0441 \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u043C\u0438 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430\u043C\u0438

sections.windows.tptwindow.title=TPTWindow
sections.windows.tptwindow.info=\u0420\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u0438\u0435 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u043E\u0433\u043E \u043A\u043B\u0430\u0441\u0441\u0430 Window, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u043F\u0435\u0440\u0435\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u043D\u0430\u0436\u0430\u0442\u0438\u044F \u043D\u0430 \u043A\u043D\u043E\u043F\u043A\u0438 Enter \u0438 ESC \u0430 \u0442\u0430\u043A \u0436\u0435 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442 \u0443\u0432\u0435\u0434\u043E\u043C\u043B\u0435\u043D\u0438\u044F \u0438 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u0441 \u0430\u0432\u0442\u043E\u043A\u043E\u043D\u0432\u0435\u0440\u0442\u0430\u0446\u0438\u0435\u0439 \u043F\u0435\u0440\u0435\u0432\u043E\u0434\u043E\u0432 \u0441\u0442\u0440\u043E\u043A\u0438 \u0432 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u044E\u0449\u0438\u0435 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B html.
sections.windows.tptwindow.instance=\u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 TPT Window
sections.windows.tptwindow.button=\u041F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0443\u0432\u0435\u0434\u043E\u043C\u043B\u0435\u043D\u0438\u0435
sections.windows.tptwindow.label=\u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043D\u0430\u0436\u0438\u043C\u0430\u0442\u044C \u043A\u043B\u0430\u0432\u0438\u0448\u0438 ENTER \u0438 ESC. \u041E\u0431\u0440\u0430\u0442\u0438\u0442\u0435 \u0432\u043D\u0438\u043C\u0430\u043D\u0438\u0435, \u0447\u0442\u043E \u043F\u0435\u0440\u0435\u0445\u0432\u0430\u0442 \u043A\u043B\u0430\u0432\u0438\u0448 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u0442\u043E\u043B\u044C\u043A\u043E \u0435\u0441\u043B\u0438 \u043A\u0430\u043A\u043E\u0439-\u043D\u0438\u0431\u0443\u0434\u044C \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432 \u043E\u043A\u043D\u0435 \u0438\u043C\u0435\u0435\u0442 \u0444\u043E\u043A\u0443\u0441, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u044D\u0442\u0430 \u043A\u043D\u043E\u043F\u043A\u0430 \u043D\u0438\u0436\u0435.
sections.windows.tptwindow.notify.title=\u0423\u0432\u0435\u0434\u043E\u043C\u043B\u0435\u043D\u0438\u0435
sections.windows.tptwindow.notify.text=\u0422\u0435\u043A\u0441\u0442 \u044D\u0442\u043E\u0433\u043E \u0443\u0432\u0435\u0434\u043E\u043C\u043B\u0435\u043D\u0438\u044F \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0441\u0438\u043C\u0432\u043E\u043B\u044B \u043F\u0435\u0440\u0435\u0432\u043E\u0434\u0430 \u0441\u0442\u0440\u043E\u043A\u0438.\n\u042D\u0442\u0438 \u0441\u0438\u043C\u0432\u043E\u043B\u044B \u0431\u0443\u0434\u0443\u0442\na\u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u043D\u044B \u0432 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B html &lt;br&gt\nin \u0447\u0442\u043E\u0431\u044B \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u0441\u0442\u0440\u043E\u043A.\n \u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u043C\u0435\u0442\u043E\u0434 \u043A\u043B\u0430\u0441\u0441\u0430 Window - showNotification - \u044D\u0442\u043E\u0433\u043E \u043D\u0435 \u0434\u0435\u043B\u0430\u0435\u0442.
sections.windows.tptwindow.enter.title=\u041D\u0430\u0436\u0430\u0442\u0430 \u043A\u043B\u0430\u0432\u0438\u0448\u0430 ENTER
sections.windows.tptwindow.enter.text=\u041D\u0430\u0436\u0430\u0442\u0438\u0435 \u043A\u043B\u0430\u0432\u0438\u0448\u0438 ENTER \u0431\u044B\u043B\u043E \u043F\u0435\u0440\u0435\u0445\u0432\u0430\u0447\u0435\u043D\u043E
sections.windows.tptwindow.esc.title=\u041D\u0430\u0436\u0430\u0442\u0430 \u043A\u043B\u0430\u0432\u0438\u0448\u0430 ESC
sections.windows.tptwindow.esc.text=\u041D\u0430\u0436\u0430\u0442\u0438\u0435 \u043A\u043B\u0430\u0432\u0438\u0448\u0438 ESC \u0431\u044B\u043B\u043E \u043F\u0435\u0440\u0435\u0445\u0432\u0430\u0447\u0435\u043D\u043E
sections.windows.tpthtmlwindow.title=TPTHTMLWindow
sections.windows.tpthtmlwindow.info=\u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0441 \u043B\u0435\u0433\u043A\u043E\u0441\u0442\u044C\u044E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C html \u0448\u0430\u0431\u043B\u043E\u043D \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0444\u043E\u043D\u0430 \u0434\u043B\u044F \u043E\u043A\u043D\u0430
sections.windows.tpthtmlwindow.caption=\u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440 TPTHtmlWindow
sections.windows.tpthtmlwindow.search=\u0412\u044B \u0438\u0441\u043A\u0430\u043B\u0438:


sections.widgets.title=\u0412\u0438\u0434\u0436\u0435\u0442\u044B
sections.widgets.info=\u041D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0432\u0438\u0434\u0436\u0435\u0442\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u044B \u0432 \u0440\u0430\u0437\u043D\u044B\u0445 \u043C\u0435\u0441\u0442\u0430\u0445 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F

sections.widgets.view.title=\u041F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u0435\u043B\u044C \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0439
sections.widgets.view.info=TPTMultiView \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u0438\u043C\u0438 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F\u043C\u0438 \u043E\u043A\u043D\u0430 (\u043F\u0430\u043D\u0435\u043B\u0438) \u0438 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0430\u0442\u044C\u0441\u044F \u043C\u0435\u0436\u0434\u0443 \u043D\u0438\u043C\u0438. \u0412 \u043E\u0434\u0438\u043D \u043C\u043E\u043C\u0435\u043D\u0442 \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u0432\u0438\u0434\u043D\u043E \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u043E (\u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0435) \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0435. \u041F\u0440\u0438 \u043F\u0435\u0440\u0435\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0438 \u043C\u0435\u0436\u0434\u0443 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F\u043C\u0438 \u043C\u043E\u0436\u043D\u043E \u0442\u0430\u043A \u0436\u0435 \u043F\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u0442\u044C \u0438\u043C \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B.
multiview.demo.title=TPTMultiView
go.to.view.1=\u041F\u0435\u0440\u0435\u0439\u0442\u0438 \u0432 \u0440\u0435\u0436\u0438\u043C 1
go.to.view.2=\u041F\u0435\u0440\u0435\u0439\u0442\u0438 \u0432 \u0440\u0435\u0436\u0438\u043C 2
go.to.view.3=\u041F\u0435\u0440\u0435\u0439\u0442\u0438 \u0432 \u0440\u0435\u0436\u0438\u043C 3
view1.title=\u0420\u0435\u0436\u0438\u043C 1
view2.title=\u0420\u0435\u0436\u0438\u043C 2
view3.title=\u0420\u0435\u0436\u0438\u043C 3
view.upload1.title=\u0424\u0430\u0439\u043B #1
view.upload2.title=\u0424\u0430\u0439\u043B #2
view.upload3.title=\u0424\u0430\u0439\u043B #3

lazyloader.title=\u041A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043E\u0442\u043B\u043E\u0436\u0435\u043D\u043D\u043E\u0439 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438
lazyloader.info=TPTLazyLoadingLayout \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u0438 \u043F\u043E\u043C\u0435\u0449\u0430\u0442\u044C \u0432 \u043E\u043A\u043D\u0430/\u043F\u0430\u043D\u0435\u043B\u0438 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B, \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0430 (\u0438\u043D\u0438\u0446\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F) \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0437\u0430\u043D\u0438\u043C\u0430\u0435\u0442 \u0434\u043B\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0435 \u0432\u0440\u0435\u043C\u044F. \u041F\u0440\u0438 \u044D\u0442\u043E\u043C, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0439 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u043D\u0435 \u043E\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0435\u0442\u0441\u044F, \u043D\u0430 \u0432\u0440\u0435\u043C\u044F \u0438\u043D\u0438\u0446\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438, \u043D\u0430 \u043C\u0435\u0441\u0442\u0435 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430, \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E \u043F\u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0438\u043D\u0434\u0438\u043A\u0430\u0442\u043E\u0440 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0437\u0430\u0442\u0435\u043C \u0437\u0430\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u043D\u0430 \u043E\u0440\u0438\u0433\u0438\u043D\u0430\u043B\u044C\u043D\u044B\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442.
lazyloader.caption=TPTLazyLoadingLayout
lazyloader.progress=\u0417\u0430\u0433\u0440\u0443\u0437\u043A\u0430 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0439 \u043F\u043E \u0432\u0430\u0448\u0435\u043C\u0443 \u0441\u0447\u0435\u0442\u0443, \u043F\u043E\u0434\u043E\u0436\u0434\u0438\u0442\u0435 ...
lazyloader.sample1=01.01.2008 \u0421\u043E\u0437\u0434\u0430\u043D\u0438\u0435 \u0441\u0447\u0435\u0442\u0430
lazyloader.sample2=02.01.2008 + \u0420\u0423\u0411 50000.00 \u043F\u043E\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435
lazyloader.sample3=03.01.2008 - \u0420\u0423\u0411 1500.00 \u041E\u043F\u043B\u0430\u0442\u0430 \u043F\u043E\u043A\u0443\u043F\u043A\u0438 \u0432 duty free
lazyloader.sample4=12.01.2008 - \u0420\u0423\u0411 5000.00 \u0412\u044B\u0434\u0430\u043D\u043E \u043D\u0430\u043B\u0438\u0447\u043D\u044B\u043C\u0438
lazyloader.sample5=28.01.2008 - \u0420\u0423\u0411 2550.12 \u041E\u043F\u043B\u0430\u0442\u0430 \u0432 \u0440\u0435\u0441\u0442\u043E\u0440\u0430\u043D\u0435

cap.title=\u041A\u0430\u043F\u0447\u0430
cap.info=\u041E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0441\u043E \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B\u043C \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432 \u0438 \u0444\u043E\u043D\u043E\u043C, \u0437\u0430\u0442\u0440\u0443\u0434\u043D\u044F\u044E\u0449\u0438\u043C \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u043E\u0435 \u0440\u0430\u0441\u043F\u043E\u0437\u043D\u0430\u0432\u0430\u043D\u0438\u0435 \u044D\u0442\u0438\u0445 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u043E\u0431\u044B\u0447\u043D\u043E \u043F\u0440\u0438 \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0430\u0446\u0438\u0438 \u043D\u0430 \u0444\u043E\u0440\u0443\u043C\u0435 \u0438 \u0434\u0440\u0443\u0433\u0438\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u0430\u0445, \u0433\u0434\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u0438\u0434\u0435\u043D\u0442\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043A\u0430\u043A \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u0430 \u043D\u0435 \u0440\u043E\u0431\u043E\u0442\u0430.
cap.caption=\u0420\u0430\u0431\u043E\u0442\u0430 \u043A\u0430\u043F\u0447\u0438
cap.change=\u0418\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043A\u043E\u0434

i18n.title=\u041B\u043E\u043A\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F
i18n.info=\u0412\u0435\u0431 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 tpt-demo, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u0432\u044B \u0441\u0435\u0439\u0447\u0430\u0441 \u043F\u0440\u043E\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u0435\u0442\u0435 - \u0438 \u0435\u0441\u0442\u044C \u043F\u0440\u0438\u043C\u0435\u0440 \u043B\u043E\u043A\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438. \u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u043E\u0442\u043A\u0440\u044B\u0442\u044C \u044D\u0442\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0438\u0437 \u0440\u0430\u0437\u043D\u044B\u0445 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u043E\u0432/\u0441\u0438\u0441\u0442\u0435\u043C \u0441 \u0434\u0440\u0443\u0433\u0438\u043C\u0438 \u043D\u0440\u0435\u0433\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u044B\u043C\u0438 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430\u043C\u0438 - \u0442\u0435\u043A\u0441\u0442 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u0438 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0439 \u0431\u0443\u0434\u0435\u0442 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D \u043D\u0430 \u0432\u0430\u0448\u0435\u043C \u044F\u0437\u044B\u043A\u0435. \u0412 \u043D\u0430\u0441\u0442\u043E\u044F\u0448\u0438\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0430\u043D\u044B \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u044F\u0437\u044B\u043A\u0438 - \u0420\u0443\u0441\u0441\u043A\u0438\u0439, \u0424\u0438\u043D\u0441\u043A\u0438\u0439, \u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439. \u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438 \u0441 \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043B\u0435\u043D\u043D\u044B\u043C \u0434\u0440\u0443\u0433\u0438\u043C \u0441\u0438\u0441\u0442\u0435\u043C\u043D\u044B\u043C \u044F\u0437\u044B\u043A\u043E\u043C \u0443\u0432\u0438\u0434\u044F\u0442 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0443\u044E \u0432\u0435\u0440\u0441\u0438\u044E.

qd.title=\u0412\u043E\u043F\u0440\u043E\u0441
qd.info=\u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u0434\u0438\u0430\u043B\u043E\u0433 \u0432\u043E\u043F\u0440\u043E\u0441\u0430, \u0441 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u043E\u043C, \u0442\u0435\u043A\u0441\u0442\u043E\u0432\u044B\u043C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\u043C \u0438 \u043A\u043D\u043E\u043F\u043A\u0430\u043C\u0438 \u0414\u0410 \u0438 \u041D\u0415\u0422. \u0422\u0430\u043A \u0436\u0435, \u043A\u043B\u0430\u0432\u0438\u0448\u0430 Enter \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0430\u043D\u0430\u043B\u043E\u0433\u043E\u043C \u043E\u0442\u0432\u0435\u0442\u0430 "\u0434\u0430" \u0430 \u043A\u043B\u0430\u0432\u0438\u0448\u0430 ESC - \u0430\u043D\u0430\u043B\u043E\u0433\u043E\u043C \u043E\u0442\u0432\u0435\u0442\u0430 "\u043D\u0435\u0442".
qd.caption=\u0410\u0445\u0442\u0443\u043D\u0433 !
qd.text=\u0412\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0432\u044B\u0439\u0442\u0438 ?
qd.reply=\u0412\u0430\u0448 \u043E\u0442\u0432\u0435\u0442:

md.title=\u0421\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435
md.info=\u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u0434\u0438\u0430\u043B\u043E\u0433 \u0441 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u043E\u043C, \u0442\u0435\u043A\u0441\u0442\u043E\u0432\u044B\u043C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\u043C \u0438 \u043A\u043D\u043E\u043A\u043F\u043E\u0439 \u041E\u041A \u0434\u043B\u044F \u0437\u0430\u043A\u0440\u044B\u0442\u0438\u044F. \u0412\u044B \u0442\u0430\u043A \u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u0434\u0438\u0430\u043B\u043E\u0433 \u043A\u043B\u0430\u0432\u0438\u0448\u0435\u0439 Enter \u0438\u043B\u0438 ESC
md.message=\u0424\u0435\u0434\u043E\u0440 \u0441\u043E\u0432\u0441\u0435\u043C \u043B\u0438\u043F\u043A\u0438\u0439 \u0441\u0442\u0430\u043B, \u0435\u0433\u043E \u0434\u0430\u0436\u0435 \u0442\u0440\u043E\u0433\u0430\u0442\u044C \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u043E !
md.reply=\u0422\u043E-\u0442\u043E \u0436\u0435

dd.title=\u0417\u0430\u0433\u0440\u0443\u0437\u043A\u0430 \u0444\u0430\u0439\u043B\u0430
dd.info=\u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u0434\u0438\u0430\u043B\u043E\u0433 \u0441 \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043A\u043E\u043C, \u0442\u0435\u043A\u0441\u0442\u043E\u0432\u044B\u043C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\u043C \u0438 \u0441\u0441\u044B\u043B\u043A\u043E\u0439 \u043D\u0430 \u0441\u043A\u0430\u0447\u0438\u0432\u0430\u043D\u0438\u0435 \u043A\u0430\u043A\u043E\u0433\u043E-\u043B\u0438\u0431\u043E \u0444\u0430\u0439\u043B\u0430.
dd.message=\u0421\u043A\u0430\u0447\u0430\u0439 \u044D\u0442\u043E, \u0434\u0440\u0443\u0436\u0438\u0449\u0435 !

cd.title=\u041F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0439 \u0434\u0438\u0430\u043B\u043E\u0433
cd.info=\u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0442\u043E\u0431\u0440\u0430\u0437\u0438\u0442\u044C \u043B\u044E\u0431\u043E\u0439 Vaadin \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435 \u0442\u0435\u043A\u0441\u0442\u0430 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u044F \u0430 \u0442\u0430\u043A \u0436\u0435 \u043B\u044E\u0431\u043E\u0439 \u043D\u0430\u0431\u043E\u0440 \u0438\u0437 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0445 \u043A\u043D\u043E\u043F\u043E\u043A - \u0414\u0410, \u041D\u0415\u0422, \u041E\u041A, \u041E\u0422\u041C\u0415\u041D\u0410
cd.reply= pressed...

cdd.title=\u041F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u0435
cdd.info=\u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u0434\u0438\u0430\u043B\u043E\u0433 \u0441 \u0442\u0435\u043A\u0441\u0442\u043E\u0432\u044B\u043C \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435\u043C \u0438 \u0434\u0432\u0443\u043C\u044F \u043A\u043D\u043E\u043F\u043A\u0430\u043C\u0438 - \u041E\u041A \u0438 \u041E\u0422\u041C\u0415\u041D\u0410. \u0422\u0430\u043A \u0436\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0437\u0430\u043A\u0440\u044B\u0442 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u043C \u043D\u0430\u0436\u0430\u0442\u0438\u0435\u043C \u043D\u0430 \u043A\u043B\u0430\u0432\u0438\u0448\u0438 Enter \u0438 ESC.
cdd.message=\u0412\u044B \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u044B \u0434\u0430\u0442\u044C \u043C\u043D\u0435 1000 \u0440\u0443\u0431\u043B\u0435\u0439 ?
cdd.reply=\u0412\u044B \u043E\u0442\u0432\u0435\u0442\u0438\u043B\u0438 -

cqd.title=\u0414\u0438\u0430\u043B\u043E\u0433 \u0442\u0438\u043F\u0430 \u0414\u0410/\u041D\u0415\u0422/\u041E\u0422\u041C\u0415\u041D\u0410
cqd.info=\u0414\u043B\u044F \u043E\u0441\u043E\u0431\u043E \u043C\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0445. \u0410\u043D\u0430\u043B\u043E\u0433 \u0434\u0438\u0430\u043B\u043E\u0433\u0430 \u0442\u0438\u043F\u0430 "\u0412\u043E\u043F\u0440\u043E\u0441", \u043D\u043E \u0432 \u0434\u043E\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043A\u043D\u043E\u043F\u043A\u0443 \u041E\u0422\u041C\u0415\u041D\u0410
cqd.message=\u0412\u044B \u0443\u0432\u0435\u0440\u0435\u043D\u044B \u0447\u0442\u043E \u0445\u043E\u0442\u0438\u0442\u0435 \u0443\u0439\u0442\u0438 \u043D\u0435 \u0437\u0430\u043F\u043B\u0430\u0442\u0438\u0432 ?
cqd.reply=\u0412\u0430\u0448 \u043E\u0442\u0432\u0435\u0442:

java.src.title=\u0418\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043A\u043E\u0434
demo.run=\u0417\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u043F\u0440\u0438\u043C\u0435\u0440
demo.src=\u041F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0438\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043A\u043E\u0434

sizer.title=\u0420\u0430\u0441\u043F\u043E\u0440\u043A\u0430
sizer.info=TPTSizer - \u043F\u0440\u043E\u0441\u0442\u0430\u044F \u0440\u0430\u0441\u043F\u043E\u0440\u043A\u0430 \u0434\u043B\u044F \u044D\u043A\u043E\u043D\u043E\u043C\u0438\u0438 \u0432\u0440\u0435\u043C\u0435\u043D\u0438 \u043A\u043E\u0434\u0438\u043D\u0433\u0430. \u041F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0437\u0430 \u043E\u0434\u0438\u043D \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u043E\u0440 \u0441\u043E\u0437\u0434\u0430\u0442 \u0440\u0430\u0441\u043F\u043E\u0440\u043A\u0443 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0439 \u0448\u0438\u0440\u0438\u043D\u044B \u0438/\u0438\u043B\u0438 \u0432\u044B\u0441\u043E\u0442\u044B \u0438 \u0432\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0435\u0435 \u0432 \u0440\u043E\u0434\u0438\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442.
sizer.caption=TPTSizer
sizer.label1=\u0421\u0442\u0440\u043E\u043A\u0430 2
sizer.label2=\u0421\u0442\u0440\u043E\u043A\u0430 2. \u0411\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u0430 \u0440\u0430\u0441\u043F\u043E\u0440\u043A\u0435, \u044F \u043E\u0442\u0441\u0442\u0443\u043F\u0430\u044E \u043E\u0442 \u043F\u0435\u0440\u0432\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0438 \u0442\u043E\u0447\u043D\u043E \u043D\u0430 30 \u043F\u0438\u043A\u0441\u0435\u043B\u0435\u0439.

sections.dialogs.title=\u0421\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0435 \u0434\u0438\u0430\u043B\u043E\u0433\u0438
sections.dialogs.info=\u0410\u043D\u0430\u043B\u043E\u0433 JOptionPane \u0432 Swing - \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0439 \u0434\u0438\u0430\u043B\u043E\u0433\u0438 \u043D\u0430 \u0432\u0441\u0435 \u0441\u043B\u0443\u0447\u0430\u0438 \u0436\u0438\u0437\u043D\u0438, \u043D\u0443 \u043F\u043E\u0447\u0442\u0438 \u043D\u0430 \u0432\u0441\u0435...
